In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],'Age':[31,32,33,np.nan],'City':[np.nan,'Hyd','Mumbai','Chennai']}

In [5]:
data1=pd.DataFrame(dict1)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [6]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [8]:
data1.isnull().sum() #every datd has one missing value is theree

Names    1
Age      1
City     1
dtype: int64

In [13]:
data1.isnull().sum()/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [12]:
len(data1)

4

In [14]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [15]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],'Age':[31,32,33,None],'City':[None,'Hyd','Mumbai','Chennai']}

In [20]:
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [22]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [23]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [1]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],'Age':[31,32,33,'Null'],'City':['Null','Hyd','Mumbai','Chennai']}

In [31]:
data3=pd.DataFrame(dict3)
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

In [32]:
data3.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

**Method-1:**

In [33]:
#Fill the missing values with random number

In [34]:
dict4={'Names':['Sunnu','Bunnu','Bunty',np.nan],'Age':[21,19,np.nan,33],'City':['jmkt',np.nan,'hnk','hnk']}

In [35]:
data4=pd.DataFrame(dict4)

In [36]:
data4

   Names   Age  City
0  Sunnu  21.0  jmkt
1  Bunnu  19.0   NaN
2  Bunty   NaN   hnk
3    NaN  33.0   hnk

In [38]:
data4.isnull()

   Names    Age   City
0  False  False  False
1  False  False   True
2  False   True  False
3   True  False  False

In [40]:
data4.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

**Method-1:**
    #Fill the missing values with random number

$dataframe name=data4$
#method name.fillna

In [17]:
import numpy as np
import pandas as pd
dict4={'Names':['Sunnu','Bunnu','Bunty',np.nan],'Age':[21,19,np.nan,33],'City':['jmkt',np.nan,'hnk','hnk']}
data4=pd.DataFrame(dict4)
data4.fillna(18)

   Names   Age  City
0  Sunnu  21.0  jmkt
1  Bunnu  19.0    18
2  Bunty  18.0   hnk
3     18  33.0   hnk

**Method-2**
- method 2 :is filling the values with random number on specific column 
- ùëëùëéùë°ùëéùëìùëüùëéùëöùëíùëõùëéùëöùëí=ùëëùëéùë°ùëé4
- #method name.fillna

data4['Names'].fillna('Sai',inplace=True)
data4

In [56]:
#create dataframe again

dict1=dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],'Age':[31,32,33,np.nan],'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

**Method-3:**

- bfill

- ffill 

- pad

- backfill

In [58]:
data1.fillna(method='backfill')
# in names index 2 is missed it will replace by index 3 as 'Mahesh'
# in age 4 index is missed to replace from down there is no index ,so it is as it is Nan
# in city 0 index is replaced by its index 1 as 'HYd'

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [59]:
data1.fillna(method='bfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [60]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [61]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

- backfill and bfill both are same
- ffill and pad both are same
- as we concluded from above data1.fillna(method=)

**Method-4:**

- mean 

- median

- mode

In [62]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [64]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [67]:
data1['Age'].fillna(age_mean,inplace=True)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

In [69]:
age_median=data1['Age'].median()
age_median

32.0

In [71]:
data1['Age'].fillna(age_median,inplace=True)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

In [72]:
age_mode=data1['Age'].mode()
age_mode

0    32.0
Name: Age, dtype: float64

In [73]:
data1['Age'].fillna(age_mode,inplace=True)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

In [74]:
# level1: mean median mode
# level2: bfill fill
# level3:

***Method-5:***

***KNN imputer***

- KNN : K nearest neighbours
    
- in the KKN imputer instad of taking mean of all the values

- will chose neighbours data

- will take those mean only

In [93]:
# n_neighbors is parameter can choose by user
# if we dont chooseby default it will take as =5

In [110]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [106]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

***Method-06:***

- Based on other columns

- some times all above methods will not provide good justification

- at that time we need to check other colummns dependency

- Most of the time pick a column which have highest correlation

In [ ]:
-